## Subset_observation(Rows)

- https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({'a':[4,5,6], 
                   'b':[7,8,9], 
                   'c':[10,11,12]}, 
                  index = pd.MultiIndex.from_tuples(
                      [('d',1),('d',2),('e',2)],
                      names = ['n','v']))
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [4]:
df[df>7]

      a    b   c
n v
d 1 NaN  NaN  10
  2 NaN  8.0  11
e 2 NaN  9.0  12

In [5]:
df[df.b > 7]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12

In [6]:
df.b > 7

n  v
d  1    False
   2     True
e  2     True
Name: b, dtype: bool

In [7]:
df[df.a < 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [8]:
df[df.c > 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [9]:
df[df['c'] > 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [10]:
df[df['a'] < 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [11]:
df[df['c'] >= 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

- drop_duplicates() : 중복된 값 삭제

In [12]:
df.drop_duplicates()
# 현재 중복된 값 없음

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [14]:
# 임의로 중복값 생성
df2 = pd.DataFrame({'a':[4,5,6,6], 
                   'b':[7,8,9,9], 
                   'c':[10,11,12,12]}, 
                  index = pd.MultiIndex.from_tuples(
                      [('d',1),('d',2),('e',2),('e',3)],
                      names = ['n','v']))
df2

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [15]:
df2.drop_duplicates()

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [16]:
df2 # 여전히 중복된 값은 남아있다.

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [17]:
df2.drop_duplicates(inplace = True)
# in place of noun : ~을 대신하다
# python에서 inplace 사용 권장하지 않음
df2

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [19]:
df2 = df.drop_duplicates()
df2

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [20]:
df2 = pd.DataFrame({'a':[4,5,6,6], 
                   'b':[7,8,9,9], 
                   'c':[10,11,12,12]}, 
                  index = pd.MultiIndex.from_tuples(
                      [('d',1),('d',2),('e',2),('e',3)],
                      names = ['n','v']))
df2

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [21]:
df = df.drop_duplicates(keep = 'last')
df
# 마지막행에 있는 값을 사용함

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

## Logic in Python (and pandas)
- &, |, ~, ^, df.any(), df.all()
- and, or, not, xor, any, all

In [22]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [23]:
df['a'] != 7

n  v
d  1    True
   2    True
e  2    True
Name: a, dtype: bool

In [24]:
df['b'] != 7

n  v
d  1    False
   2     True
e  2     True
Name: b, dtype: bool

In [25]:
df[df['b'] != 7] # 7이 아닌 값만 가지고 오고 싶을 때

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12

In [ ]:
# df.column.isin(values)
df['a'].isin()
# Use a list of one element instead: values는 리스트 형태

In [27]:
df['a'].isin([5]) # 특히, 한글 사용 시 유용

n  v
d  1    False
   2     True
e  2    False
Name: a, dtype: bool

In [28]:
df.a.isin([5])
# a column에 원소 5가 포함되어 있는지 확인

n  v
d  1    False
   2     True
e  2    False
Name: a, dtype: bool

In [30]:
pd.isnull(df)
# null값이 없다고 확인

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False  False  False

In [31]:
# 임의로 null값 생성
df3 = pd.DataFrame({'a':[4,5,6,6,np.nan], 
                   'b':[7,8,np.nan,9,9], 
                   'c':[10,11,12,np.nan,12]}, 
                  index = pd.MultiIndex.from_tuples(
                      [('d',1),('d',2),('e',2),('e',3),('e',4)],
                      names = ['n','v']))
df3

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [32]:
pd.isnull(df3) # df3에 null 값 찾기

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False   True  False
  3  False  False   True
  4   True  False  False

In [33]:
df3['a'].isnull()

n  v
d  1    False
   2    False
e  2    False
   3    False
   4     True
Name: a, dtype: bool

In [34]:
df3['a'].isnull().sum() # null 값의 총 갯수

1

In [35]:
pd.notnull(df3)

         a      b      c
n v
d 1   True   True   True
  2   True   True   True
e 2   True  False   True
  3   True   True  False
  4  False   True   True

In [36]:
df3.notnull()

         a      b      c
n v
d 1   True   True   True
  2   True   True   True
e 2   True  False   True
  3   True   True  False
  4  False   True   True

In [37]:
df3.notnull().sum()

a    4
b    4
c    4
dtype: int64

In [38]:
df3.any()

a    True
b    True
c    True
dtype: bool

In [39]:
~df3.a.notnull()

n  v
d  1    False
   2    False
e  2    False
   3    False
   4     True
Name: a, dtype: bool

In [40]:
1 and 1

1

In [41]:
True and True

True

In [ ]:
# dataframe에서 and 사용 불가

In [42]:
df3[df3.b == 7] | df3[df3.a == 5] # or 연산자

TypeError: unsupported operand type(s) for |: 'float' and 'bool'

- head, tail로 데이터 미리 보기

In [43]:
df3.head() # default : 5행 보여줌

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [44]:
df3.head(2)

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0

In [45]:
df3.tail(2)

       a    b     c
n v
e 3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [46]:
df3.sample(frac = 0.5)
# frac() : 일정 비율로 random 하게 sampling 해 옴

       a    b     c
n v
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN

In [47]:
df3.sample(frac = 0.7)

       a    b     c
n v
d 2  5.0  8.0  11.0
  1  4.0  7.0  10.0
e 2  6.0  NaN  12.0
  4  NaN  9.0  12.0

In [48]:
df3.sample(frac = 0.3)

       a    b     c
n v
e 3  6.0  9.0   NaN
  2  6.0  NaN  12.0

In [49]:
df3.sample(n=10)
# 현재 데이터가 5개 밖에 없음

ValueError: Cannot take a larger sample than population when 'replace=False'

In [50]:
df3.sample(n=5)

       a    b     c
n v
e 4  NaN  9.0  12.0
  3  6.0  9.0   NaN
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0

In [ ]:
# Tip
# 비율로 샘플링 하고 싶다면? frac = 0.xx
# 지정된 횟수, 개수로 샘플링 하고 싶다면? n=x

- df.iloc[10:20]
- select rows by position

In [51]:
df3.iloc[10:20] # 10에서 20까지 범위에 값이 없기 때문

Empty DataFrame
Columns: [a, b, c]
Index: []

In [52]:
df.iloc[:2] # 0, 1 가지고 옴

     a  b   c
n v
d 1  4  7  10
  2  5  8  11

In [53]:
 df3.iloc[:3]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0

In [54]:
df3.iloc[3:] # 3번째 인덱스에서 끝까지 가지고 옴

       a    b     c
n v
e 3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [55]:
df3.iloc[-2:]

       a    b     c
n v
e 3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [56]:
df3.iloc[-2:-1]

       a    b   c
n v
e 3  6.0  9.0 NaN

- df3.nlargest[n, 'value']

In [57]:
df4 = pd.DataFrame({'a':[1,10,8,11,-1],
                   'b':list('abcde'),
                   'c':[1.0, 2.0, np.nan, 3.0, 4.0]})
df4

    a  b    c
0   1  a  1.0
1  10  b  2.0
2   8  c  NaN
3  11  d  3.0
4  -1  e  4.0

In [58]:
df4.nlargest(1, 'a') # a컬럼에서 가장 큰 값만 가지고 오기

    a  b    c
3  11  d  3.0

In [ ]:
df4.nlargest(1, 'b')
# Type Error 타입에러 발생, 숫자 컬럼에서만 가져올 수 있음

In [60]:
df4.nlargest(3, 'c')

    a  b    c
4  -1  e  4.0
3  11  d  3.0
1  10  b  2.0

In [62]:
df.nsmallest(3, 'a')

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12